rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_XRDC.h
#define XRDC_HWCFG2_PIDP30_MASK                  (0x40000000U)
#define XRDC_HWCFG2_PIDP30_SHIFT                 (30U)
#define XRDC_HWCFG2_PIDP30_WIDTH                 (1U)
#define XRDC_HWCFG2_PIDP30(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP30_SHIFT)) & XRDC_HWCFG2_PIDP30_MASK)

#define XRDC_HWCFG2_PIDP31_MASK                  (0x80000000U)
#define XRDC_HWCFG2_PIDP31_SHIFT                 (31U)
#define XRDC_HWCFG2_PIDP31_WIDTH                 (1U)
#define XRDC_HWCFG2_PIDP31(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_HWCFG2_PIDP31_SHIFT)) & XRDC_HWCFG2_PIDP31_MASK)
/*! @} */

/*! @name MDACFG - Master Domain Assignment Configuration */
/*! @{ */

#define XRDC_MDACFG_NMDAR_MASK                   (0xFU)
#define XRDC_MDACFG_NMDAR_SHIFT                  (0U)
#define XRDC_MDACFG_NMDAR_WIDTH                  (4U)
#define XRDC_MDACFG_NMDAR(x)                     (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NMDAR_SHIFT)) & XRDC_MDACFG_NMDAR_MASK)

#define XRDC_MDACFG_NCM_MASK                     (0x80U)
#define XRDC_MDACFG_NCM_SHIFT                    (7U)
#define XRDC_MDACFG_NCM_WIDTH                    (1U)
#define XRDC_MDACFG_NCM(x)                       (((uint8_t)(((uint8_t)(x)) << XRDC_MDACFG_NCM_SHIFT)) & XRDC_MDACFG_NCM_MASK)
/*! @} */

/*! @name MRCFG - Memory Region Configuration */
/*! @{ */

#define XRDC_MRCFG_NMRGD_MASK                    (0x1FU)
#define XRDC_MRCFG_NMRGD_SHIFT                   (0U)
#define XRDC_MRCFG_NMRGD_WIDTH                   (5U)
#define XRDC_MRCFG_NMRGD(x)                      (((uint8_t)(((uint8_t)(x)) << XRDC_MRCFG_NMRGD_SHIFT)) & XRDC_MRCFG_NMRGD_MASK)
/*! @} */

/*! @name DERRLOC - Domain Error Location */
/*! @{ */

#define XRDC_DERRLOC_MRCINST_MASK                (0xFFFFU)
#define XRDC_DERRLOC_MRCINST_SHIFT               (0U)
#define XRDC_DERRLOC_MRCINST_WIDTH               (16U)
#define XRDC_DERRLOC_MRCINST(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_DERRLOC_MRCINST_SHIFT)) & XRDC_DERRLOC_MRCINST_MASK)

#define XRDC_DERRLOC_PACINST_MASK                (0xF0000U)
#define XRDC_DERRLOC_PACINST_SHIFT               (16U)
#define XRDC_DERRLOC_PACINST_WIDTH               (4U)
#define XRDC_DERRLOC_PACINST(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_DERRLOC_PACINST_SHIFT)) & XRDC_DERRLOC_PACINST_MASK)
/*! @} */

/*! @name DERR_W0 - Domain Error Word 0 */
/*! @{ */

#define XRDC_DERR_W0_EADDR_MASK                  (0xFFFFFFFFU)
#define XRDC_DERR_W0_EADDR_SHIFT                 (0U)
#define XRDC_DERR_W0_EADDR_WIDTH                 (32U)
#define XRDC_DERR_W0_EADDR(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W0_EADDR_SHIFT)) & XRDC_DERR_W0_EADDR_MASK)
/*! @} */

/*! @name DERR_W1 - Domain Error Word 1 */
/*! @{ */

#define XRDC_DERR_W1_EDID_MASK                   (0xFU)
#define XRDC_DERR_W1_EDID_SHIFT                  (0U)
#define XRDC_DERR_W1_EDID_WIDTH                  (4U)
#define XRDC_DERR_W1_EDID(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W1_EDID_SHIFT)) & XRDC_DERR_W1_EDID_MASK)

#define XRDC_DERR_W1_EATR_MASK                   (0x700U)
#define XRDC_DERR_W1_EATR_SHIFT                  (8U)
#define XRDC_DERR_W1_EATR_WIDTH                  (3U)
#define XRDC_DERR_W1_EATR(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W1_EATR_SHIFT)) & XRDC_DERR_W1_EATR_MASK)

#define XRDC_DERR_W1_ERW_MASK                    (0x800U)
#define XRDC_DERR_W1_ERW_SHIFT                   (11U)
#define XRDC_DERR_W1_ERW_WIDTH                   (1U)
#define XRDC_DERR_W1_ERW(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W1_ERW_SHIFT)) & XRDC_DERR_W1_ERW_MASK)

#define XRDC_DERR_W1_EPORT_MASK                  (0x7000000U)
#define XRDC_DERR_W1_EPORT_SHIFT                 (24U)
#define XRDC_DERR_W1_EPORT_WIDTH                 (3U)
#define XRDC_DERR_W1_EPORT(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W1_EPORT_SHIFT)) & XRDC_DERR_W1_EPORT_MASK)

#define XRDC_DERR_W1_EST_MASK                    (0xC0000000U)
#define XRDC_DERR_W1_EST_SHIFT                   (30U)
#define XRDC_DERR_W1_EST_WIDTH                   (2U)
#define XRDC_DERR_W1_EST(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W1_EST_SHIFT)) & XRDC_DERR_W1_EST_MASK)
/*! @} */

/*! @name DERR_W3 - Domain Error Word 3 */
/*! @{ */

#define XRDC_DERR_W3_RECR_MASK                   (0xC0000000U)
#define XRDC_DERR_W3_RECR_SHIFT                  (30U)
#define XRDC_DERR_W3_RECR_WIDTH                  (2U)
#define XRDC_DERR_W3_RECR(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_DERR_W3_RECR_SHIFT)) & XRDC_DERR_W3_RECR_MASK)
/*! @} */

/*! @name PID - Process Identifier */
/*! @{ */

#define XRDC_PID_PID_MASK                        (0x20U)
#define XRDC_PID_PID_SHIFT                       (5U)
#define XRDC_PID_PID_WIDTH                       (1U)
#define XRDC_PID_PID(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_PID_SHIFT)) & XRDC_PID_PID_MASK)

#define XRDC_PID_LMNUM_MASK                      (0x3F0000U)
#define XRDC_PID_LMNUM_SHIFT                     (16U)
#define XRDC_PID_LMNUM_WIDTH                     (6U)
#define XRDC_PID_LMNUM(x)                        (((uint32_t)(((uint32_t)(x)) << XRDC_PID_LMNUM_SHIFT)) & XRDC_PID_LMNUM_MASK)

#define XRDC_PID_ELK22H_MASK                     (0x1000000U)
#define XRDC_PID_ELK22H_SHIFT                    (24U)
#define XRDC_PID_ELK22H_WIDTH                    (1U)
#define XRDC_PID_ELK22H(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_PID_ELK22H_SHIFT)) & XRDC_PID_ELK22H_MASK)

#define XRDC_PID_TSM_MASK                        (0x10000000U)
#define XRDC_PID_TSM_SHIFT                       (28U)
#define XRDC_PID_TSM_WIDTH                       (1U)
#define XRDC_PID_TSM(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_TSM_SHIFT)) & XRDC_PID_TSM_MASK)

#define XRDC_PID_LK2_MASK                        (0x60000000U)
#define XRDC_PID_LK2_SHIFT                       (29U)
#define XRDC_PID_LK2_WIDTH                       (2U)
#define XRDC_PID_LK2(x)                          (((uint32_t)(((uint32_t)(x)) << XRDC_PID_LK2_SHIFT)) & XRDC_PID_LK2_MASK)
/*! @} */

/*! @name MDA_W0_0_DFMT0 - Master Domain Assignment */
/*! @{ */

#define XRDC_MDA_W0_0_DFMT0_DID_MASK             (0x1U)
#define XRDC_MDA_W0_0_DFMT0_DID_SHIFT            (0U)
#define XRDC_MDA_W0_0_DFMT0_DID_WIDTH            (1U)
#define XRDC_MDA_W0_0_DFMT0_DID(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_0_DFMT0_DID_SHIFT)) & XRDC_MDA_W0_0_DFMT0_DID_MASK)

