rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_XRDC.h
#define XRDC_MDA_W0_3_DFMT0_PID_MASK             (0x3F0000U)
#define XRDC_MDA_W0_3_DFMT0_PID_SHIFT            (16U)
#define XRDC_MDA_W0_3_DFMT0_PID_WIDTH            (6U)
#define XRDC_MDA_W0_3_DFMT0_PID(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_3_DFMT0_PID_SHIFT)) & XRDC_MDA_W0_3_DFMT0_PID_MASK)

#define XRDC_MDA_W0_3_DFMT0_DFMT_MASK            (0x20000000U)
#define XRDC_MDA_W0_3_DFMT0_DFMT_SHIFT           (29U)
#define XRDC_MDA_W0_3_DFMT0_DFMT_WIDTH           (1U)
#define XRDC_MDA_W0_3_DFMT0_DFMT(x)              (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_3_DFMT0_DFMT_SHIFT)) & XRDC_MDA_W0_3_DFMT0_DFMT_MASK)

#define XRDC_MDA_W0_3_DFMT0_LK1_MASK             (0x40000000U)
#define XRDC_MDA_W0_3_DFMT0_LK1_SHIFT            (30U)
#define XRDC_MDA_W0_3_DFMT0_LK1_WIDTH            (1U)
#define XRDC_MDA_W0_3_DFMT0_LK1(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_3_DFMT0_LK1_SHIFT)) & XRDC_MDA_W0_3_DFMT0_LK1_MASK)

#define XRDC_MDA_W0_3_DFMT0_VLD_MASK             (0x80000000U)
#define XRDC_MDA_W0_3_DFMT0_VLD_SHIFT            (31U)
#define XRDC_MDA_W0_3_DFMT0_VLD_WIDTH            (1U)
#define XRDC_MDA_W0_3_DFMT0_VLD(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_MDA_W0_3_DFMT0_VLD_SHIFT)) & XRDC_MDA_W0_3_DFMT0_VLD_MASK)
/*! @} */

/*! @name PDAC_W0 - Peripheral Domain Access Control Word 0 */
/*! @{ */

#define XRDC_PDAC_W0_D0ACP_MASK                  (0x7U)
#define XRDC_PDAC_W0_D0ACP_SHIFT                 (0U)
#define XRDC_PDAC_W0_D0ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D0ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D0ACP_SHIFT)) & XRDC_PDAC_W0_D0ACP_MASK)

#define XRDC_PDAC_W0_D1ACP_MASK                  (0x38U)
#define XRDC_PDAC_W0_D1ACP_SHIFT                 (3U)
#define XRDC_PDAC_W0_D1ACP_WIDTH                 (3U)
#define XRDC_PDAC_W0_D1ACP(x)                    (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_D1ACP_SHIFT)) & XRDC_PDAC_W0_D1ACP_MASK)

#define XRDC_PDAC_W0_SNUM_MASK                   (0xF000000U)
#define XRDC_PDAC_W0_SNUM_SHIFT                  (24U)
#define XRDC_PDAC_W0_SNUM_WIDTH                  (4U)
#define XRDC_PDAC_W0_SNUM(x)                     (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_SNUM_SHIFT)) & XRDC_PDAC_W0_SNUM_MASK)

#define XRDC_PDAC_W0_SE_MASK                     (0x40000000U)
#define XRDC_PDAC_W0_SE_SHIFT                    (30U)
#define XRDC_PDAC_W0_SE_WIDTH                    (1U)
#define XRDC_PDAC_W0_SE(x)                       (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W0_SE_SHIFT)) & XRDC_PDAC_W0_SE_MASK)
/*! @} */

/*! @name PDAC_W1 - Peripheral Domain Access Control Word 1 */
/*! @{ */

#define XRDC_PDAC_W1_LK2_MASK                    (0x60000000U)
#define XRDC_PDAC_W1_LK2_SHIFT                   (29U)
#define XRDC_PDAC_W1_LK2_WIDTH                   (2U)
#define XRDC_PDAC_W1_LK2(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W1_LK2_SHIFT)) & XRDC_PDAC_W1_LK2_MASK)

#define XRDC_PDAC_W1_VLD_MASK                    (0x80000000U)
#define XRDC_PDAC_W1_VLD_SHIFT                   (31U)
#define XRDC_PDAC_W1_VLD_WIDTH                   (1U)
#define XRDC_PDAC_W1_VLD(x)                      (((uint32_t)(((uint32_t)(x)) << XRDC_PDAC_W1_VLD_SHIFT)) & XRDC_PDAC_W1_VLD_MASK)
/*! @} */

/*! @name XRDC_MRGD_W0 - Memory Region Descriptor Word 0 */
/*! @{ */

#define XRDC_XRDC_MRGD_W0_SRTADDR_MASK           (0xFFFFFFE0U)
#define XRDC_XRDC_MRGD_W0_SRTADDR_SHIFT          (5U)
#define XRDC_XRDC_MRGD_W0_SRTADDR_WIDTH          (27U)
#define XRDC_XRDC_MRGD_W0_SRTADDR(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W0_SRTADDR_SHIFT)) & XRDC_XRDC_MRGD_W0_SRTADDR_MASK)
/*! @} */

/*! @name XRDC_MRGD_W1 - Memory Region Descriptor Word 1 */
/*! @{ */

#define XRDC_XRDC_MRGD_W1_ENDADDR_MASK           (0xFFFFFFE0U)
#define XRDC_XRDC_MRGD_W1_ENDADDR_SHIFT          (5U)
#define XRDC_XRDC_MRGD_W1_ENDADDR_WIDTH          (27U)
#define XRDC_XRDC_MRGD_W1_ENDADDR(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W1_ENDADDR_SHIFT)) & XRDC_XRDC_MRGD_W1_ENDADDR_MASK)
/*! @} */

/*! @name XRDC_MRGD_W2 - Memory Region Descriptor Word 2 */
/*! @{ */

#define XRDC_XRDC_MRGD_W2_D0ACP_MASK             (0x7U)
#define XRDC_XRDC_MRGD_W2_D0ACP_SHIFT            (0U)
#define XRDC_XRDC_MRGD_W2_D0ACP_WIDTH            (3U)
#define XRDC_XRDC_MRGD_W2_D0ACP(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W2_D0ACP_SHIFT)) & XRDC_XRDC_MRGD_W2_D0ACP_MASK)

#define XRDC_XRDC_MRGD_W2_D1ACP_MASK             (0x38U)
#define XRDC_XRDC_MRGD_W2_D1ACP_SHIFT            (3U)
#define XRDC_XRDC_MRGD_W2_D1ACP_WIDTH            (3U)
#define XRDC_XRDC_MRGD_W2_D1ACP(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W2_D1ACP_SHIFT)) & XRDC_XRDC_MRGD_W2_D1ACP_MASK)

#define XRDC_XRDC_MRGD_W2_SNUM_MASK              (0xF000000U)
#define XRDC_XRDC_MRGD_W2_SNUM_SHIFT             (24U)
#define XRDC_XRDC_MRGD_W2_SNUM_WIDTH             (4U)
#define XRDC_XRDC_MRGD_W2_SNUM(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W2_SNUM_SHIFT)) & XRDC_XRDC_MRGD_W2_SNUM_MASK)

#define XRDC_XRDC_MRGD_W2_SE_MASK                (0x40000000U)
#define XRDC_XRDC_MRGD_W2_SE_SHIFT               (30U)
#define XRDC_XRDC_MRGD_W2_SE_WIDTH               (1U)
#define XRDC_XRDC_MRGD_W2_SE(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W2_SE_SHIFT)) & XRDC_XRDC_MRGD_W2_SE_MASK)
/*! @} */

/*! @name XRDC_MRGD_W3 - Memory Region Descriptor Word 3 */
/*! @{ */

#define XRDC_XRDC_MRGD_W3_LK2_MASK               (0x60000000U)
#define XRDC_XRDC_MRGD_W3_LK2_SHIFT              (29U)
#define XRDC_XRDC_MRGD_W3_LK2_WIDTH              (2U)
#define XRDC_XRDC_MRGD_W3_LK2(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W3_LK2_SHIFT)) & XRDC_XRDC_MRGD_W3_LK2_MASK)

#define XRDC_XRDC_MRGD_W3_VLD_MASK               (0x80000000U)
#define XRDC_XRDC_MRGD_W3_VLD_SHIFT              (31U)
#define XRDC_XRDC_MRGD_W3_VLD_WIDTH              (1U)
#define XRDC_XRDC_MRGD_W3_VLD(x)                 (((uint32_t)(((uint32_t)(x)) << XRDC_XRDC_MRGD_W3_VLD_SHIFT)) & XRDC_XRDC_MRGD_W3_VLD_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group XRDC_Register_Masks */

/*!
 * @}
 */ /* end of group XRDC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32M27x_XRDC_H_) */
